// Массивдерди аныктоо
let array1 = [1, 2, 3];
let array2 = [4, 5, 6];

// Массивдин баштапкы формасы 
console.log('Массивдин баштапкы формасы:',array1);


// Массивдерди concat функциясы менен бириктирүү
let combined = array1.concat(array2);

// Консолго чыгаруулар
console.log("Бириктирилген массив:", combined); // [1, 2, 3, 4, 5, 6]

// Көп массивдерди бириктирүү
let array3 = [7, 8, 9];
let combinedAll = array1.concat(array2, array3);

// Бардык массивдердин бириктирилген формасын чыгарып көрсөтүү
console.log("Бардык массивдердин бириктирилген формасы:", combinedAll); // [1, 2, 3, 4, 5, 6, 7, 8, 9]
